unesco-backend/app/controllers/application_controller.rb

    def get_current_user
        user_id = decode_token['id']
        User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]