unesco-backend/app/controllers/saved_sites_controller.rb

    def create
        user = get_current_user
        new_saved_site = SavedSite.create(
            user_id: user.id,
            site_reference_id: params[:site_id],
            bucketlist: params[:bucketlist],
            visited: params[:visited]
        )
---
INSERT INTO "saved_sites" ("user_id", "site_reference_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["site_reference_id", 576], ["status", "bucketlist"], ["created_at", "2019-11-22 16:32:29.541266"], ["updated_at", "2019-11-22 16:32:29.541266"]]