unesco-backend/app/controllers/site_references_controller.rb

SELECT "site_references".* FROM "site_references"
SELECT "site_references".* FROM "site_references" WHERE "site_references"."site_id" = $1 LIMIT $2  [["site_id", 252], ["LIMIT", 1]]
---
    def sites
        sites = SiteReference.all
        site_ids = sites.map{ |site| site.site_id }
        response = site_ids.map{ |id| API.get_site(id) }

        response.each do |site|
            site_reference = SiteReference.find_by(site_id: site["id"])
            site["tags"] = site_reference.tags.map{|tag| tag.name }

SELECT "site_references".* FROM "site_references" WHERE "site_references"."site_id" = $1 LIMIT $2  [["site_id", 252], ["LIMIT", 1]]
---
    def site
        site = SiteReference.find_by(site_id: params[:id])