unesco-backend/app/controllers/users_controller.rb

    def signup
        new_user = User.create(
            first_name: params[:first_name],
            last_name: params[:last_name],
            email: params[:email],
            password: params[:password]
        )
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def signin
        user = User.find_by(email: params[:email])
        if user && user.authenticate(params[:password])
            # user is valid
            render json: {id: user.id, first_name: user.first_name, token: issue_token({id: user.id})}
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jimas42@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "elizabeth.prendergast@gmail.com"], ["LIMIT", 1]]