unesco-backend/app/controllers/users_controller.rb

    def signin
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "elizabeth.prendergast@gmail.com"], ["LIMIT", 1]]